stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
/**
  ******************************************************************************
  * @file    esl_profile_ap.c
  * @author  GPM WBL Application Team
  * @brief   Implementation of ESL commands management.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#include <stdint.h>
#include <stdlib.h>
#include <assert.h>
#include <stdbool.h>
#include "ble.h"
#include "esl_profile_ap.h"
#include "app_common.h"
#include "stm_list.h"
#include "gatt_client_app.h"    
#include "stm32_seq.h"
#include "app_ble.h"
#include "esl_profile_ap.h"
#include "otp_client.h"

#define MAX_COMMAND_SIZE                        (17U)
#define MAX_ESL_PAYLOAD_SIZE                    (48U)
#define EAD_MIC_SIZE                            (4U)
#define EAD_RANDOMZER_SIZE                      (5U)
#define MAX_UNENCRYPTED_ADV_PAYLOAD             (MAX_ESL_PAYLOAD_SIZE + 2)
#define MAX_ADV_PAYLOAD                         (MAX_UNENCRYPTED_ADV_PAYLOAD + EAD_RANDOMZER_SIZE + EAD_MIC_SIZE + 2)
    
#define ESL_AP_ESL_INFO_RECORD_TYPE                                            0
#define ESL_AP_SYNC_KEY_RECORD_TYPE                                            1

typedef struct {
  uint8_t group_id;
  uint8_t esl_id;
  resp_cb_t resp_cb;
  uint8_t cmd[MAX_COMMAND_SIZE];  
} cmd_ECP_buff_t;
    
typedef struct {
  tListNode node;
  uint8_t tx_count;
  resp_cb_t resp_cb;
  uint8_t cmd[0];  
} cmd_buff_t;

/* List of ESL bonded to AP */
typedef struct {
  tListNode cmd_queue;
  uint8_t adv_packet_len;
  ALIGN(4) uint8_t unencrypted_payload[MAX_UNENCRYPTED_ADV_PAYLOAD]; /* alignement needed for encryption */
  uint8_t adv_packet[MAX_ADV_PAYLOAD];
} esl_group_info_t;

esl_group_info_t esl_group_info[MAX_GROUPS];

ESL_AP_context_t ESL_AP_Context;

cmd_ECP_buff_t cmd_ECP_buff;

static uint8_t GetEslIdFromResponse(uint8_t subevent, uint8_t response_slot, uint8_t *esl_id_p);


void ESL_AP_Init(void)
{
  NVMDB_status_t status;
  NVMDB_HandleType esl_db_h;
  NVMDB_RecordSizeType record_size;
  
  for(int i = 0; i < MAX_GROUPS; i++)
  {
    LST_init_head(&esl_group_info[i].cmd_queue);
  }
  
  /* Check if there is a stored AP sync key material */
  NVMDB_HandleInit(AP_NVM_ID, &esl_db_h);
  
  status = NVMDB_ReadNextRecord(&esl_db_h, ESL_AP_SYNC_KEY_RECORD_TYPE, 0,
                                (uint8_t *)&ESL_AP_Context.ap_sync_key_material, sizeof(ESL_AP_Context.ap_sync_key_material),
                                &record_size);
  if(status == NVMDB_STATUS_OK)
  {
    APP_DBG_MSG("Retrieved saved AP sync key\n");
    
    APP_DBG_MSG("Session key: ");
    for(int i = sizeof(ESL_AP_Context.ap_sync_key_material.session_key); i >= 0; i--)
    {
      APP_DBG_MSG("%02X ", ESL_AP_Context.ap_sync_key_material.session_key[i]);
    }
    APP_DBG_MSG("\nIV: ");
    for(int i = sizeof(ESL_AP_Context.ap_sync_key_material.iv); i >= 0; i--)
    {
      APP_DBG_MSG("%02X ", ESL_AP_Context.ap_sync_key_material.iv[i]);
    }
    APP_DBG_MSG("\n");
  }
  else
  {
    if(status == NVMDB_STATUS_END_OF_DB)
    {
      APP_DBG_MSG("No saved AP Sync key\n");      
    }
    else
    {
      APP_DBG_MSG("Error retrieving AP Sync key\n");
      NVMDB_Erase(AP_NVM_ID);    
      APP_DBG_MSG("NVM erased\n");
    }
      
    ESL_AP_GenerateKeyMaterial(&ESL_AP_Context.ap_sync_key_material);
    
    APP_DBG_MSG("Generated new AP Sync key\n");
    
    APP_DBG_MSG("Session key: ");
    for(int i = sizeof(ESL_AP_Context.ap_sync_key_material.session_key); i >= 0; i--)
    {
      APP_DBG_MSG("%02X ", ESL_AP_Context.ap_sync_key_material.session_key[i]);
    }
    APP_DBG_MSG("\nIV: ");
    for(int i = sizeof(ESL_AP_Context.ap_sync_key_material.iv); i >= 0; i--)
    {
      APP_DBG_MSG("%02X ", ESL_AP_Context.ap_sync_key_material.iv[i]);
    }
    APP_DBG_MSG("\n");
    
    status = NVMDB_AppendRecord(&esl_db_h, ESL_AP_SYNC_KEY_RECORD_TYPE, 0, NULL, sizeof(ESL_AP_Context.ap_sync_key_material), &ESL_AP_Context.ap_sync_key_material);
    
    if(status != NVMDB_STATUS_OK)
    {
      APP_DBG_MSG("Error while saving key\n");
      
      return;
    }
    
    APP_DBG_MSG("Key saved\n");
  }
}

/* insert the ESL on list if it is not already present, else update Conn_Handle */
uint8_t ESL_AP_StoreESLInfo(const esl_info_t *p_esl_info)
{
  esl_info_t esl_info_tmp;
  NVMDB_HandleType esl_db_h;
  NVMDB_status_t status;
  
  if(ESL_AP_GetESLInfoByBDAddress(p_esl_info->bd_address_type, p_esl_info->bd_address, &esl_info_tmp, &esl_db_h) == 0)
  {
    /* Device already present */
    APP_DBG_MSG("ESL already configured\n");
    if(memcmp(&esl_info_tmp, p_esl_info, sizeof(esl_info_t)) == 0)
    {
      APP_DBG_MSG("No need to update info\n");
      return 0;
    }
    else
    {
      APP_DBG_MSG("Record deleted\n");
      NVMDB_DeleteRecord(&esl_db_h);
    }
  }
  
  status = NVMDB_AppendRecord(&esl_db_h, ESL_AP_ESL_INFO_RECORD_TYPE, 0, NULL, sizeof(esl_info_t), p_esl_info);
  if(status != NVMDB_STATUS_OK)
  {
    APP_DBG_MSG("Error while adding record in NVM\n");
    return 2;
  }
  
  APP_DBG_MSG("New record added\n");
  
  return 0;
}

uint8_t ESL_AP_DeleteESLInfo(uint16_t esl_address)
{
  NVMDB_HandleType esl_db_h;
  NVMDB_RecordSizeType record_size;
  NVMDB_status_t status;
  esl_info_t esl_info;
  
  APP_DBG_MSG("ESL_AP_DeleteESLInfo\n");
  
  NVMDB_HandleInit(AP_NVM_ID, &esl_db_h);
  
  do {
    
    status = NVMDB_ReadNextRecord(&esl_db_h, ESL_AP_ESL_INFO_RECORD_TYPE, 0, (uint8_t *)&esl_info, sizeof(esl_info_t), &record_size);
    
    if (esl_info.esl_address == esl_address)
    {
      NVMDB_DeleteRecord(&esl_db_h);
      aci_gap_remove_bonded_device(esl_info.bd_address_type, esl_info.bd_address);
      APP_DBG_MSG("Record removed\n");
      return 0;
    }    
  
  }while(status == NVMDB_STATUS_OK);
  
  if(status == NVMDB_STATUS_END_OF_DB)
  {
    /* No record found */
    return 1;
  }
  else
  {
    /* Error */
    return 2;
  }
}

/* Update ESL queue with info written on characteristics during configuration */
uint8_t ESL_AP_UpdateESLInfo(uint8_t bd_address_type, const uint8_t bd_address[6], esl_info_t new_esl_info) 
{  
  esl_info_t esl_info;
  NVMDB_HandleType esl_db_h;
  uint8_t ret;
  NVMDB_status_t nvm_status;
  
  ret = ESL_AP_GetESLInfoByBDAddress(bd_address_type, bd_address, &esl_info, &esl_db_h);
  
  if(ret > 1)
  {
    /* Error */
    APP_DBG_MSG("NVM Error\n");
    return 2;
  }
  
  if(ret == 0)
  {
    /* record found */
    if(memcmp(&esl_info, &new_esl_info, sizeof(esl_info_t)) == 0)
    {
      APP_DBG_MSG("No need to update\n");
      return 0;      
    }
    
    NVMDB_DeleteRecord(&esl_db_h);
  }
      
  nvm_status = NVMDB_AppendRecord(&esl_db_h, ESL_AP_ESL_INFO_RECORD_TYPE, 0, NULL, sizeof(esl_info_t), &new_esl_info);
  if(nvm_status != NVMDB_STATUS_OK)
  {
    return 2;
  }
  
  APP_DBG_MSG("NVM Info Updated\n");
  
