stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
  return 0;
}

/* Search by Peer address and return an ESL node on the list */
uint8_t ESL_AP_GetESLInfoByBDAddress(uint8_t bd_address_type, const uint8_t bd_address[6], esl_info_t *p_esl_info, NVMDB_HandleType *p_db_h)
{  
  NVMDB_RecordSizeType record_size;
  NVMDB_status_t status;
  
  NVMDB_HandleInit(AP_NVM_ID, p_db_h);
  
  do {
    
    status = NVMDB_ReadNextRecord(p_db_h, ESL_AP_ESL_INFO_RECORD_TYPE, 0, (uint8_t *)p_esl_info, sizeof(esl_info_t), &record_size);
    
    if (p_esl_info->bd_address_type == bd_address_type
        && (memcmp(p_esl_info->bd_address, bd_address, sizeof(p_esl_info->bd_address)) == 0))
    {
      return 0;
    }    
  
  }while(status == NVMDB_STATUS_OK);
  
  if(status == NVMDB_STATUS_END_OF_DB)
  {
    /* No record found */
    return 1;
  }
  else
  {
    /* Error */
    return 2;
  }
}

uint8_t ESL_AP_GetESLInfoByESLAddress(uint16_t esl_address, esl_info_t *p_esl_info, NVMDB_HandleType *p_db_h)
{  
  NVMDB_RecordSizeType record_size;
  NVMDB_status_t status;
  
  NVMDB_HandleInit(AP_NVM_ID, p_db_h);
  
  do {
    
    status = NVMDB_ReadNextRecord(p_db_h, ESL_AP_ESL_INFO_RECORD_TYPE, 0, (uint8_t *)p_esl_info, sizeof(esl_info_t), &record_size);
    
    if (p_esl_info->esl_address == esl_address)
    {
      return 0;
    }    
  
  }while(status == NVMDB_STATUS_OK);
  
  return 1; 
}

uint8_t ESL_AP_ClearNVMDB(void)
{
  uint8_t ret;
  
  APP_DBG_MSG("Clear Security DB\n");
  
  ret = aci_gap_clear_security_db();
  if(ret != BLE_STATUS_SUCCESS)
    return 1;
  
  APP_DBG_MSG("Clear ESL info DB\n");
  
  ret = NVMDB_Erase(AP_NVM_ID);
  
  if(ret != NVMDB_STATUS_OK)
    return 2;
  
  return 0;
}

void ESL_AP_GenerateKeyMaterial(ESL_AP_key_material_t *p_key_material)
{
  hci_le_rand(&p_key_material->session_key[0]);
  hci_le_rand(&p_key_material->session_key[8]);
  
  hci_le_rand(p_key_material->iv);
}

static void * PrepareCmdBuff(uint8_t cmd_opcode, uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb)
{
  uint8_t cmd_length;
  cmd_buff_t * cmd_buff;
  
  if(group_id >= MAX_GROUPS)
    return NULL;
  
  cmd_length = GET_LENGTH_FROM_OPCODE(cmd_opcode);
  
  cmd_buff = malloc(sizeof(cmd_buff_t)+cmd_length);
  
  if(cmd_buff == NULL)
    return NULL;
  
  LST_insert_tail(&esl_group_info[group_id].cmd_queue, &cmd_buff->node);
  
  cmd_buff->resp_cb = resp_cb;
  
  if(esl_id == BRC_ESL_ID)
  {
    cmd_buff->tx_count = BRC_RETRANSMISSIONS + 1;
  }
  else
  {
    cmd_buff->tx_count = UNC_RETRANSMISSIONS + 1;
  }
  
  cmd_buff->cmd[0] = cmd_opcode;
  cmd_buff->cmd[1] = esl_id;
  
  return cmd_buff;
}

// to prepare cmd packet on Updating state and send command by ECP char
static uint8_t PrepareCmdECPBuff(uint8_t cmd_opcode, uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb)
{
  uint8_t cmd_length;
  
  if(group_id >= MAX_GROUPS)
    return 0;
  
  cmd_length = GET_LENGTH_FROM_OPCODE(cmd_opcode);
  
  cmd_ECP_buff.group_id = group_id;
  cmd_ECP_buff.esl_id = esl_id;
  
  cmd_ECP_buff.resp_cb = resp_cb;
  
  cmd_ECP_buff.cmd[0] = cmd_opcode;
  cmd_ECP_buff.cmd[1] = esl_id;
  
  return cmd_length;
}

/* If bResponse is true the command wait for an ESL response
   else the command has no response */
static uint8_t ESL_AP_SendCmdByECP(uint8_t cmd_length, bool bResponse)
{
  tBleStatus ble_status;
  
  ble_status = GATT_CLIENT_APP_WriteECP(cmd_ECP_buff.cmd, cmd_length, bResponse);
  if (ble_status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> GATT_CLIENT_APP_WriteECP - fail, result: 0x%02X\n", ble_status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: GATT_CLIENT_APP_WriteECP\n");
  }     
  
  return ble_status;
}

void ESL_AP_ECPNotificationReceived(uint8_t *current_data_resp_p)
{
  cmd_ECP_buff.resp_cb(cmd_ECP_buff.group_id, cmd_ECP_buff.esl_id, current_data_resp_p);
}

uint8_t ESL_AP_Command(uint8_t cmd_opcode, uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb)
{
  uint8_t ret;
  cmd_buff_t * cmd_buff;
  uint8_t cmd_length;
  esl_info_t esl_info;
  NVMDB_HandleType db_h;

  if(esl_id != BRC_ESL_ID)
  {
    /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
    //TODO: instead of searching for ESL address, keep ESL address of connected ESL
    // and check if the provided ESL address matches the address of the connected one.
    ret = ESL_AP_GetESLInfoByESLAddress(GET_ESL_ADDRESS(group_id,esl_id), &esl_info, &db_h); 
    if (ret != 0)  
      return 2;
  }
  
  if (esl_id == BRC_ESL_ID || memcmp(get_bleAppContext_address(), esl_info.bd_address, BD_ADDR_SIZE) != 0) // TODO: check addr type
  { 
    /* ESL is not connected. */
    cmd_buff = PrepareCmdBuff(cmd_opcode, group_id, esl_id, resp_cb);
    if(cmd_buff == NULL)
      return 2;
  } 
  else
  {   
    /* ESL is connected. */
    cmd_length = PrepareCmdECPBuff(cmd_opcode, group_id, esl_id, resp_cb);
       
    if(cmd_length == 0)
      return 1;
    
    if (esl_id == BRC_ESL_ID)
      return 1;
    else
      ESL_AP_SendCmdByECP(cmd_length, true);
  }  
  return 0;  
}

static void LedCmdBuff(uint8_t *cmd, uint8_t led_index, uint8_t led_component, uint64_t flash_pattern, uint8_t off_period, uint8_t on_period, uint16_t repeat) 
{
  cmd[2] = led_index;
  /* if the LED is a monochrome LED, the value of the Color fields shall be ignored.*/
  cmd[3] = led_component; /* RGB and Brightness component. Not used.  */                          
  
  //Flashing pattern
  memcpy(&cmd[4], &flash_pattern, 5);
  //Flashing off period
  cmd[9] = off_period;
  //Flashing on period
  cmd[10] = on_period;
  
  //Repeat type and duration
  memcpy(&cmd[11], &repeat, 2);
}

uint8_t ESL_AP_CmdLedControl(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, uint8_t led_index, uint8_t led_component, uint64_t flash_pattern, uint8_t off_period, uint8_t on_period, uint16_t repeat)
{
  uint8_t ret;
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_LED_CONTROL;
  esl_info_t esl_info;
  NVMDB_HandleType db_h;
  
  if(esl_id != BRC_ESL_ID)
  {
    /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
    ret = ESL_AP_GetESLInfoByESLAddress(GET_ESL_ADDRESS(group_id,esl_id), &esl_info, &db_h); 
    if (ret != 0)  
      return 2;
  }
  
