stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
  if (esl_id == BRC_ESL_ID || memcmp(get_bleAppContext_address(), esl_info.bd_address, BD_ADDR_SIZE) != 0)    
  {   
    // to prepare cmd packet on Synchronized state
    cmd_buff = PrepareCmdBuff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    LedCmdBuff(cmd_buff->cmd, led_index, led_component, flash_pattern, off_period, on_period, repeat);
    HOST_TO_LE_32(&cmd_buff->cmd[13], absolute_time);
  }
  else
  {  
    // to prepare cmd packet on Updating state
    uint8_t cmd_length;
    
    cmd_length = PrepareCmdECPBuff(cmd_opcode, group_id, esl_id, resp_cb);
   
    if(cmd_length == 0)
      return 1;
    
    LedCmdBuff(cmd_ECP_buff.cmd, led_index, led_component, flash_pattern, off_period, on_period, repeat);
    HOST_TO_LE_32(&cmd_ECP_buff.cmd[13], absolute_time);
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);
  }  

  return 0;  
}

uint8_t ESL_AP_CmdDisplayTimedImage(uint8_t group_id, uint8_t esl_id, resp_cb_t resp_cb, uint8_t display_index, uint8_t image_index, uint32_t absolute_time)
{
  uint8_t ret;
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_DISPLAY_TIMED_IMG;
  esl_info_t esl_info;
  NVMDB_HandleType db_h;
  
  if(esl_id != BRC_ESL_ID)
  {
    /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
    ret = ESL_AP_GetESLInfoByESLAddress(GET_ESL_ADDRESS(group_id,esl_id), &esl_info, &db_h); 
    if (ret != 0)  
      return 2;
  }
  
  if (esl_id == BRC_ESL_ID || memcmp(get_bleAppContext_address(), esl_info.bd_address, BD_ADDR_SIZE) != 0)
  { 
    // to prepare cmd packet on Synchronized state  
    cmd_buff = PrepareCmdBuff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    cmd_buff->cmd[2] = display_index;
    cmd_buff->cmd[3] = image_index;
    HOST_TO_LE_32(&cmd_buff->cmd[4], absolute_time);
  }
  else
  {
    // to prepare cmd packet on Updating state  
    uint8_t cmd_length;
    
    cmd_length = PrepareCmdECPBuff(cmd_opcode, group_id, esl_id, resp_cb);
  
    if(cmd_length == 0)
      return 1;
    
    cmd_ECP_buff.cmd[2] = display_index;
    cmd_ECP_buff.cmd[3] = image_index;
    HOST_TO_LE_32(&cmd_ECP_buff.cmd[4], absolute_time);
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);  
  }
 
  return 0;  
}

uint8_t ESL_AP_CmdRefreshDisplay(uint8_t group_id, uint8_t esl_id, uint8_t display_index, resp_cb_t resp_cb)
{
  uint8_t ret;
  cmd_buff_t * cmd_buff;
  uint8_t cmd_opcode = ESL_CMD_REFRESH_IMG;
  esl_info_t esl_info;
  NVMDB_HandleType db_h;
  
  if(esl_id != BRC_ESL_ID)
  {
    /* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
    ret = ESL_AP_GetESLInfoByESLAddress(GET_ESL_ADDRESS(group_id,esl_id), &esl_info, &db_h); 
    if (ret != 0)  
      return 2;
  }
  
  if (esl_id == BRC_ESL_ID || memcmp(get_bleAppContext_address(), esl_info.bd_address, BD_ADDR_SIZE) != 0)  
  {   
    // to prepare cmd packet on Synchronized state  
    cmd_buff = PrepareCmdBuff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_buff == NULL)
      return 1;
    
    cmd_buff->cmd[2] = display_index;
  }
  else
  {
    // to prepare cmd packet on Updating state  
    uint8_t cmd_length;
    
    cmd_length = PrepareCmdECPBuff(cmd_opcode, group_id, esl_id, resp_cb);
    
    if(cmd_length == 0)
      return 1;
    
    cmd_ECP_buff.cmd[2] = display_index;
    // to send command by ECP char
    ESL_AP_SendCmdByECP(cmd_length, true);  
  }
  return 0;  
}

uint8_t ESL_AP_CmdFactoryReset(void)
{
  uint8_t cmd_length;

  /* The Factory Reset command is reserved for use in the Configuring state and  
     the Updating state, the AP shall not send the Factory Reset command to an 
     ESL that is in the Synchronized state. */ 
  
  cmd_length = PrepareCmdECPBuff(ESL_CMD_FACTORY_RESET,
                                    GET_GROUP_ID(ESL_AP_Context.conn_esl_info.esl_address),
                                    GET_ESL_ID(ESL_AP_Context.conn_esl_info.esl_address),
                                    NULL);
  
  if(cmd_length == 0)
    return 1;
  
  if(ESL_AP_SendCmdByECP(cmd_length, false) != BLE_STATUS_SUCCESS)
  {    
    return 1;      
  }
  
  ESL_AP_DeleteESLInfo(ESL_AP_Context.conn_esl_info.esl_address);
  
  return 0;
}

uint8_t ESL_AP_CmdUpdateComplete(void)
{
  uint8_t cmd_length;
  
  cmd_length = PrepareCmdECPBuff(ESL_CMD_UPDATE_COMPLETE,
                                    GET_GROUP_ID(ESL_AP_Context.conn_esl_info.esl_address),
                                    GET_ESL_ID(ESL_AP_Context.conn_esl_info.esl_address),
                                    NULL);
  
  if(cmd_length == 0)
    return 1;
  
  // to send command by ECP char
  if (ESL_AP_SendCmdByECP(cmd_length, false) == BLE_STATUS_SUCCESS)   //No response 
  {    
    /* After the Update Complete command sending, the AP shall start the PAST procedure */
    periodic_sync_info_transfer();
    APP_DBG_MSG("Synchronized State transition\n");
    return 0;
  }
  
  return 1;  
}

void ESL_AP_SubeventDataRequest(uint8_t subevent)
{
  tBleStatus ble_status;
  tListNode *list_head_p;
  cmd_buff_t* current_node_p;
  cmd_buff_t* node_to_remove_p = NULL;
  esl_group_info_t *esl_group_info_p;
  uint8_t *unencrypted_payload_p;
  uint8_t curr_payload_len;
  Subevent_Data_Ptr_Parameters_t Subevent_Data_Ptr_Parameters;
  uint8_t cmd_length;
  uint8_t num_cmd = 0;
  
  /* subevent is the Group ID */
  
  if(subevent >= MAX_GROUPS)
    return;
  
  esl_group_info_p = &esl_group_info[subevent];  
 
  unencrypted_payload_p = esl_group_info_p->unencrypted_payload;
  
  unencrypted_payload_p[1] = AD_TYPE_ELECTRONIC_SHELF_LABEL;
  
  /* First byte of synchronization packet for commands is the Group ID. */
  /* Group_ID with value N shall be trasmitted in a PAwR subevent with number N */
  unencrypted_payload_p[2] = subevent; 
  curr_payload_len = 3; 
  
  list_head_p = &esl_group_info_p->cmd_queue;
    
  current_node_p = (cmd_buff_t*)list_head_p->next;
  
  while(&current_node_p->node != list_head_p)
  {
    num_cmd++;
    
    if(num_cmd > PAWR_NUM_RESPONSE_SLOTS && current_node_p->cmd[ESL_ID_CMD_OFFSET] != BRC_ESL_ID)
    {
      /* We do not send a unicast command if we cannot receive a response for it.
         However we can send a broadcast command regardless of the number of
         response slots, because they have no response. */
      break;
    }
        
    cmd_length = GET_LENGTH_FROM_OPCODE(current_node_p->cmd[0]);
    
    if(curr_payload_len + cmd_length > MAX_ESL_PAYLOAD_SIZE)
      break;
    
    /* NOTE: this is a workaround: command should be removed from the queue in 
       ESL_AP_ResponseReport(). However, no response report is received if the
       response packet is not received. So the command is removed at next data
       request event. This will be fixed in next version of BLE stack. 
       This workaround does not work if a subevent data request is received
       before next reponse report. */
    /* Remove command from list if transmission count has reached 0. */
    if(current_node_p->tx_count == 0)
    {
      LST_remove_node(&current_node_p->node);
      node_to_remove_p = current_node_p;
    }
    else 
    {
      current_node_p->tx_count--;      
      memcpy(&unencrypted_payload_p[curr_payload_len], current_node_p->cmd, cmd_length);
      curr_payload_len += cmd_length;
    }
    
    LST_get_next_node(&current_node_p->node, (tListNode **)&current_node_p);
    
