stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
    if(node_to_remove_p != NULL)
    {
      free(node_to_remove_p);
      node_to_remove_p = NULL;
    } 
  }
  
  if(curr_payload_len == 3)
  {
    /* No commands to be sent. */
    esl_group_info_p->adv_packet_len = 0;
    
    return;
  }
  
  unencrypted_payload_p[0] = curr_payload_len - 1;    /* Lenght of following data. */
  
  /*
  APP_DBG_MSG("Packet:\n"); 
  int i;
  for(i=0; i<curr_payload_len-1; i++)
  {
    APP_DBG_MSG("0x%02X - ", esl_payload_tag[i]);
  }  
  APP_DBG_MSG("0x%02X\n", esl_payload_tag[i]); */
  
  /* The "ap_sync_key_material" info is the same for all ESLs */
  ble_status = aci_gap_encrypt_adv_data(ESL_AP_Context.ap_sync_key_material.session_key,
                                        ESL_AP_Context.ap_sync_key_material.iv,
                                        curr_payload_len,
                                        (uint32_t*)unencrypted_payload_p,
                                        &esl_group_info_p->adv_packet[2]); 

  esl_group_info_p->adv_packet[0] = curr_payload_len + EAD_MIC_SIZE + EAD_RANDOMZER_SIZE + 1;
  esl_group_info_p->adv_packet[1] = AD_TYPE_ENCRYPTED_ADVERTISING_DATA;
  esl_group_info_p->adv_packet_len = esl_group_info_p->adv_packet[0] + 1;
  
    
  Subevent_Data_Ptr_Parameters.Subevent = subevent;
  Subevent_Data_Ptr_Parameters.Response_Slot_Start = 0;
  // TODO: calculate the used response slots (Response_Slot_Count) depending on the current commands.
  Subevent_Data_Ptr_Parameters.Response_Slot_Count = PAWR_NUM_RESPONSE_SLOTS;
  Subevent_Data_Ptr_Parameters.Subevent_Data_Length = esl_group_info_p->adv_packet_len ;
  Subevent_Data_Ptr_Parameters.Subevent_Data = esl_group_info_p->adv_packet;
  
  ble_status = ll_set_periodic_advertising_subevent_data_ptr(0, 1, &Subevent_Data_Ptr_Parameters);  
  if (ble_status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> ll_set_periodic_advertising_subevent_data_ptr - fail, result: 0x%02X\n", ble_status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: ll_set_periodic_advertising_subevent_data_ptr\n");
  }  
}

void ESL_AP_ResponseReport(uint8_t subevent, uint8_t response_slot, uint8_t data_length, uint8_t *data)
{
  esl_group_info_t *esl_group_info_p;
  tListNode *list_head_p;
  cmd_buff_t* current_node_p;
  cmd_buff_t* node_to_remove_p = NULL;
  uint8_t esl_id;
  uint8_t *current_data_resp_p;
  uint8_t resp_length;
  ALIGN(4) uint8_t decrypted_data[MAX_ESL_PAYLOAD_SIZE];
  uint8_t decrypted_data_length;
  uint8_t encrypted_data_length;
  tBleStatus ret;  
  esl_info_t esl_info;
  NVMDB_HandleType db_h;

  /* subevent correspond to group_id */
   
  if(subevent >= MAX_GROUPS)
    return;
  
  /* We assume only one AD type is present */
  if(data[0] != data_length - 1 || data[1] != AD_TYPE_ENCRYPTED_ADVERTISING_DATA)
    return;
  
  if(GetEslIdFromResponse(subevent, response_slot, &esl_id) != 0)
  {
    /* No corresponding ESL ID found for that response. */
    return;
  }  
  
  /* ADV data decryption */
  /* ADV packet length - 2 for Len and ED Tag (see Fig 5.1 ESL profile spec) */
  encrypted_data_length = data_length - 2; 

  /* Subevent is equal to the group id */
  ret = ESL_AP_GetESLInfoByESLAddress(GET_ESL_ADDRESS(subevent,esl_id), &esl_info, &db_h); 
  if (ret != 0)  
    return;
  
  /* take the "esl_resp_key_material" info by esl_node */  
  ret = aci_gap_decrypt_adv_data(esl_info.esl_resp_key_material.session_key,
                                 esl_info.esl_resp_key_material.iv,
                                 encrypted_data_length,
                                 &data[2], //Encrypted data on ADV packet 
                                 (uint32_t *)decrypted_data);
  
  if(ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Decryption fail.\n");
    return;
  }
  
  decrypted_data_length = decrypted_data[0] + 1;

  if((decrypted_data_length != encrypted_data_length - EAD_RANDOMZER_SIZE - EAD_MIC_SIZE) ||
     (decrypted_data[1] != AD_TYPE_ELECTRONIC_SHELF_LABEL))
  {
    return;
  }  
 
  /* Inspect sent commands and link them to the responses. */
  esl_group_info_p = &esl_group_info[subevent];
  
  list_head_p = &esl_group_info_p->cmd_queue;
    
  current_node_p = (cmd_buff_t*)list_head_p->next;
  
  current_data_resp_p = decrypted_data + 2; /* Skip first 2 bytes for AD length and type. */
  
  while(&current_node_p->node != list_head_p && current_data_resp_p < decrypted_data + decrypted_data_length)
  {
    if(current_node_p->cmd[ESL_ID_CMD_OFFSET] == esl_id)
    {
      if(current_node_p->resp_cb != NULL)
      {
        current_node_p->resp_cb(subevent, esl_id, current_data_resp_p);
      }
      
      /* Command has received a response. Remove from queue. */      
      LST_remove_node(&current_node_p->node);      
      node_to_remove_p = current_node_p;
      
      /* Pass to following response. */
      resp_length = GET_LENGTH_FROM_OPCODE(current_data_resp_p[0]);
      current_data_resp_p += resp_length;
    }
    
    LST_get_next_node(&current_node_p->node, (tListNode **)&current_node_p);
    
    if(node_to_remove_p != NULL)
    {
      free(node_to_remove_p);
      node_to_remove_p = NULL;
    }    
  }  
}

static uint8_t GetEslIdFromResponse(uint8_t subevent, uint8_t response_slot, uint8_t *esl_id_p)
{
  esl_group_info_t *esl_group_info_p;
  uint8_t *esl_payload_p;
  uint8_t esl_payload_len;
  uint8_t *cmd_p;
  int8_t cmd_idx = -1;
  uint8_t cmd_length;
  
  if(subevent >= MAX_GROUPS)
    return 1;
  
  /* Inspect last sent ESL payload. */
  esl_group_info_p = &esl_group_info[subevent];
  esl_payload_p = &esl_group_info_p->unencrypted_payload[2]; /* Two bytes for AD length and type */
  esl_payload_len = esl_group_info_p->unencrypted_payload[0] - 1;
  
  cmd_p = &esl_payload_p[1]; /* First byte contains group id */
  
  while(cmd_p < esl_payload_p + esl_payload_len)
  {
    cmd_idx++;
    
    if(cmd_idx == response_slot)
    {
      if(cmd_p[ESL_ID_CMD_OFFSET] == BRC_ESL_ID)
      {
        return 1;
      }
      
      *esl_id_p = cmd_p[ESL_ID_CMD_OFFSET];
      
