stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/esl_profile_ap.c
      return 0;
    }    
    
    cmd_length = GET_LENGTH_FROM_OPCODE(cmd_p[0]);    
    cmd_p += cmd_length;
  }
  
  return 1;
}

uint8_t ESL_AP_SetNewEslAddress(uint8_t group_id, uint8_t esl_id)
{
  if(group_id >= MAX_GROUPS)
    return 1;
  
  ESL_AP_Context.conn_esl_info.esl_address = GET_ESL_ADDRESS(group_id, esl_id);
  
  return GATT_CLIENT_APP_ConfigureESL();
}  

uint8_t ESL_AP_StartUpdate(uint8_t group_id, uint8_t esl_id)
{
  NVMDB_HandleType db_h;
  
  if(group_id >= MAX_GROUPS)
    return 1;
  
  if(ESL_AP_GetESLInfoByESLAddress(GET_ESL_ADDRESS(group_id,esl_id), &ESL_AP_Context.conn_esl_info, &db_h) != 0)
  {
    APP_DBG_MSG("ESL_AP_StartUpdate: info not found\n");
    return 2;
  }
   
  ESL_AP_Context.configuring = false;
  
  UTIL_SEQ_SetTask( 1u << CFG_TASK_UPDATING_STATE_TRANSITION, CFG_SEQ_PRIO_0);
  
  return 0;
} 

//Task for CFG_TASK_UPDATING_STATE_TRANSITION
void ESL_AP_UpdatingStateTransition(void)
{  
  /* To transition an ESL from the Synchronized state to the Updating state, 
  the AP shall use the Periodic Advertising Connection procedure.
  When the AP connects with the ESL, the ESL transitions to the Updating state. */
  create_periodic_advertising_connection(GET_GROUP_ID(ESL_AP_Context.conn_esl_info.esl_address),
                                         ESL_AP_Context.conn_esl_info.bd_address_type,
                                         ESL_AP_Context.conn_esl_info.bd_address);
}

void ESL_AP_ESLConnected(uint16_t conn_handle, uint8_t bd_address_type, const uint8_t bd_address[6])
{
  NVMDB_HandleType db_h;
    
  if(!ESL_AP_Context.provisioning)
  {
    /* We are connected to a configured ESL. */
    if(ESL_AP_GetESLInfoByBDAddress(bd_address_type, bd_address, &ESL_AP_Context.conn_esl_info, &db_h) != 0)
    {
      /* This should not happen since we should have already checked that there is a record before connecting. */
      aci_gap_terminate(conn_handle, BLE_ERROR_TERMINATED_REMOTE_USER);
      return;
    }
  }
  
  UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);
}

void ESL_AP_DisconnectionComplete(uint16_t conn_handle)
{  
  OTP_CLIENT_DisconnectionComplete();
}

uint8_t ESL_AP_CmdProvisioning(uint8_t addr_type, uint8_t address[6], uint8_t group_id, uint8_t esl_id)
{
  esl_info_t esl_info;
  NVMDB_HandleType db_h;
  uint16_t esl_address = GET_ESL_ADDRESS(group_id, esl_id);
  
  if(group_id >= MAX_GROUPS)
    return 1;
  
  /* check if group_id and esl_id is already assigned to another ESL */
  if(ESL_AP_GetESLInfoByESLAddress(esl_address, &esl_info, &db_h) == 0)
  {
    APP_DBG_MSG("ESL Address (0x%04X) already assigned!\n", esl_address);
    return 1;
  }
  
  ESL_AP_Context.provisioning = true;
  ESL_AP_Context.configuring = true;
  ESL_AP_Context.conn_esl_info.bd_address_type = addr_type;
  memcpy(ESL_AP_Context.conn_esl_info.bd_address, address, sizeof(ESL_AP_Context.conn_esl_info.bd_address));
  ESL_AP_Context.conn_esl_info.esl_address = esl_address;
  
  set_bleAppContext_address(addr_type, address);
  
  /* Connect to ESL */
  UTIL_SEQ_SetTask(1u << CFG_TASK_CONN_DEV_ID, CFG_SEQ_PRIO_0);

  return 0;
}

uint8_t ESL_AP_Reconnect(uint8_t address_type, uint8_t address[6])
{
  set_bleAppContext_address(address_type, address);
  ESL_AP_Context.provisioning = false;
  ESL_AP_Context.configuring = true;  
  
  UTIL_SEQ_SetTask(1u << CFG_TASK_CONN_DEV_ID, CFG_SEQ_PRIO_0);

  return 0;
}
